_posts/draft/css preprocessor.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">概述</a></li>
<li><a href="#sec-2">Variables</a></li>
<li><a href="#sec-3">Nested</a></li>
<li><a href="#sec-4">Partials</a></li>
<li><a href="#sec-5">Import</a></li>
<li><a href="#sec-6">Mixins</a></li>
<li><a href="#sec-7">Extend/Inheritance</a></li>
<li><a href="#sec-8">Math</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">概述</h2>
<div class="outline-text-2" id="text-1">
<p>
css是用于描述html元素的样式的，本身缺乏逻辑，当css文件随着时间推移变得庞大和复杂，难以管理的时候，程序员需要一种手段去化解记不住样式都设置了什么的尴尬。这就是css preprocess切入的地方：不直接编辑css文件，而是提供一种抽象语法，加入编程元素，对文件进行一层预处理，然后生成css文件。这里主要介绍sass这个预处理器。  
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Variables</h2>
<div class="outline-text-2" id="text-2">
<p>
需要多次使用的CSS value可以使用变量来存储。变量是以$开头的符号。
</p>
<div class="org-src-container">

<pre class="src src-sass">$font-stack:    Helvetica, sans-serif
$primary-color: #333

body
  font: 100% $font-stack
  color: $primary-color
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Nested</h2>
<div class="outline-text-2" id="text-3">
<p>
嵌套使得css的折叠样式更直观。
</p>
<div class="org-src-container">

<pre class="src src-sass">nav
  ul
    margin: 0
    padding: 0
    list-style: none

  li
    display: inline-block

  a
    display: block
    padding: 6px 12px
    text-decoration: none
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Partials</h2>
<div class="outline-text-2" id="text-4">
<p>
partial是一个只包含@import指令的的文件，partial告诉css预处理器，不要对这个文件生成相应的css文件。partial文件以下划线开头，这样：<sub>partial</sub>.sass
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Import</h2>
<div class="outline-text-2" id="text-5">
<p>
css文件可以分拆成多个小的css文件，然后在html文件里通过link引用，这样做不好的地方是每个css文件的引用都产生一个http request。sass提供imoprt指令，将多个css文件合并成为一个大的css文件，这个过程发生在server端，所以client只要一次http请求就可以获取完整的css文件。
在<sub>reset</sub>.sass中引入base.sass
</p>
<div class="org-src-container">

<pre class="src src-sass">// _reset.sass

html,
body,
ul,
ol
  margin:  0
  padding: 0
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sass">// base.sass

@import reset

body
  font: 100% Helvetica, sans-serif
  background-color: #efefef
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Mixins</h2>
<div class="outline-text-2" id="text-6">
<p>
mixin类似于其他语言的函数。
</p>
<div class="org-src-container">

<pre class="src src-sass">=border-radius($radius)
  -webkit-border-radius: $radius
  -moz-border-radius:    $radius
  -ms-border-radius:     $radius
  border-radius:         $radius

.box
  +border-radius(10px)
</pre>
</div>
<p>
支持多参数。一个很傻的例子
</p>
<div class="org-src-container">

<pre class="src src-sass">  =border-radius($radius)
  -webkit-border-radius: $radius
  -moz-border-radius:    $radius
  -ms-border-radius:     $radius
  border-radius:         $radius

.box
  +border-radius(10px)
</pre>
</div>
<p>
支持多参数。一个很傻的例子
</p>
<div class="org-src-container">

<pre class="src src-sass">=margin($top, $right, $bottom, $left)
  margin: $top $right $bottom $left

.box
  +margin(10px, 12px, 20px, 5px)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Extend/Inheritance</h2>
<div class="outline-text-2" id="text-7">
<p>
类似于c里面宏的作用，文本复制。
</p>
<div class="org-src-container">

<pre class="src src-sass">.message
  border: 1px solid #ccc
  padding: 10px
  color: #333


.success
  @extend .message
  border-color: green


.error
  @extend .message
  border-color: red


.warning
  @extend .message
  border-color: yellow
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Math</h2>
<div class="outline-text-2" id="text-8">
<p>
Sass提供了一些操作符，可以在对css value进行计算。
</p>
<div class="org-src-container">

<pre class="src src-sass">.container
  width: 100%

article[role="main"]
  float: left
  width: 600px / 960px * 100%


aside[role="complimentary"]
  float: right
  width: 300px / 960px * 100%
</pre>
</div>
</div>
</div>
